alefragnani.pascal-formatter
alefragnani.project-manager
anthropic.claude-code
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
golang.go
ibm.output-colorizer
mathiasfrohlich.kotlin
mechatroner.rainbow-csv
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.atom-keybindings
ms-vscode.hexeditor
ms-vscode.remote-explorer
ms-vscode.remote-server
ryu1kn.partial-diff
sleistner.vscode-fileutils
wmaurer.change-case
wosi.omnipascal
