adpyke.vscode-sql-formatter
alefragnani.pascal-formatter
alefragnani.project-manager
anthropic.claude-code
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
drmerfy.overtype
esbenp.prettier-vscode
firsttris.vscode-jest-runner
github.vscode-github-actions
golang.go
hashicorp.terraform
helixquar.randomeverything
ibm.output-colorizer
jpoissonnier.vscode-styled-components
mathiasfrohlich.kotlin
mechatroner.rainbow-csv
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.atom-keybindings
ms-vscode.azure-account
ms-vscode.hexeditor
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
redhat.vscode-yaml
ryu1kn.partial-diff
silvenga.edi-x12-support
sleistner.vscode-fileutils
stylelint.vscode-stylelint
waderyan.gitblame
wmaurer.change-case
wosi.omnipascal
zxh404.vscode-proto3
